backend/doctortracker-backend/src/test/jmeter/plans/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Step 1: Authenticate,3796,192,186,238,254,281,128,333,0.000%,63.07639,52.07,16.71
Step 2: GET Patients List,3783,93,92,148,160,178,4,262,0.000%,63.29050,15301.01,32.45
Step 3: CREATE Patient,3776,84,82,138,149,173,4,230,0.000%,63.23263,32.91,40.89
Step 4: GET Clinics List,3770,84,83,140,151,175,4,244,0.000%,63.14379,24.91,32.31
TOTAL,15125,113,106,196,220,259,4,333,0.000%,251.32517,15306.46,121.57